#готовые дз только здесь. 
# Дз будут удалены!!!!!!!!!!!!!!


# дз номер 4
name = input("Как тебя зовут?")
vozrast = int(input("Сколько вам лет?:"))
if vozrast >= 18:
	print(f"Вы совершеннолетний")
else:
	print(f"Вы не совершеннолетний")
print(name.isalpha())
if name.isalpha() == True:
	print(f"Введите имя!")
else:
	print(f"Привет, {name}")


# дз номер 3
age = int(input(f"Привет,сколько тебе лет?")) #Ввод возраста
support = input("С вами есть сопровождающий?(да/нет): ") #Ввод cопровождающего
if age < 12: # Если возраст меньше 12 лет
	print(f"Билет бесплатный!") # Вывод
elif 12 <= age <= 18: # Если возраст больше или равен 12 лет и меньше или равен  18 годам просит указать сопровождающего 
	if support.lower() == 'да': # Cопровождающий есть
		print( f"Билет со скидкой!") # Вывод
	elif support.lower() == 'нет': # Сопровождающего нет
		print(f"Полная стоимость билета!") # Вывод
	else:
		print(f"Ошибка: Надо было указать да/нет, а не {support}") # Вывод ошибки если пользователь решит ввести другие значения кроме да/нет
else:
	print(f"Полная стоимость билета!")
